app/controllers/application_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'd@i.m1' LIMIT 1
---
  def authenticate_user
    authenticate_or_request_with_http_basic do |username, password|
      # you probably want to guard against a wrong username, and encrypt the
      # password but this is the idea.
      @user = User.find_by_email(username)