app/controllers/task_controller.rb

SELECT `tasks`.* FROM `tasks`
---
  def index
    result = Task.all

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'd@i.m' LIMIT 1
---
  def authenticate
    authenticate_or_request_with_http_basic do |username, password|
      # you probably want to guard against a wrong username, and encrypt the
      # password but this is the idea.
      @user = User.find_by_email(username)

INSERT INTO `tasks` (`todo`, `date`, `creator_id`, `created_at`, `updated_at`) VALUES ('sdfsghyfgdfsdafsghjf ', '2019-06-14', 4, '2019-06-14 12:55:02', '2019-06-14 12:55:02')
---
  def save_task
    @task.save!