app/controllers/task_controller.rb

  def index
    result = params[:status].nil? ? Task.all : Task.all.where(status: params[:status])
---
SELECT `tasks`.* FROM `tasks` WHERE (creator_id= 4) AND `tasks`.`status` IS NULL

  def destroy
    @task.destroy!
---
DELETE FROM `tasks` WHERE `tasks`.`id` = 2

  def load_task
    @task = Task.find_by_id(params[:id])
---
SELECT  `tasks`.* FROM `tasks` WHERE (creator_id= 4) AND `tasks`.`id` = 11 LIMIT 1

  def save_task
    @task.save!
---
INSERT INTO `tasks` (`todo`, `date`, `creator_id`, `status`, `created_at`, `updated_at`) VALUES ('Edited Task ', '2019-06-14', 4, 1, '2019-06-14 15:58:55', '2019-06-14 15:58:55')
UPDATE `tasks` SET `todo` = 'Edited Task ', `status` = TRUE, `updated_at` = '2019-06-14 15:56:30' WHERE `tasks`.`id` = 11