app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('vaddd@in.com', '$2a$10$w.qW/K0nPGWFPS5Qt7Xrw.agHzUEqW4HNvedJGEeQE.q4TaTCT3kG', '2019-06-14 04:43:52', '2019-06-14 04:43:52')
---
  def create
    @user = User.new(user_params)

    if @user.save